{
  "blogs": [
    {
      "title": "Latest Updates on Imports",
      "body": "Video provides a powerful way to help you prove your point. When you click Online Video, you can paste in the embed code for the video you want to add. You can also type a keyword to search online for the video that best fits your document. To make your document look professionally produced, Word provides header, footer, cover page, and text box designs that complement each other. For example, you can add a matching cover page, header, and sidebar. Click Insert and then choose the elements you want from the different galleries.",
      "author": "Dreamteam",
      "id": 1
    },
    {
      "title": "UNDERSTANDING MORE INSIGHT ABOUT IMPORTATION",
      "body": " Importing from China is not easy and its not a viable option for everyone. It is a phenomeonon that we often detect when talking to companies and many find it difficult to understand the complications involved. In fact, often across companies that, without previous experience or knowledge, have attemted to import and the results turns to be negative.\nImporting products from China can lead to various problems if you simply do not have proven experience in this area. Experiencing difficulties during the importation process often leads companies to say that importing from China is not a good option. This is a false statement. In general, problems occur when the process is not left in a safe hands of a professional in strategic sourcing which allows the entire international purchasing process to be completed successfully. In many cases, problems with import begin at the initial stage during the study and selections.\nSupplier selection: Lack of knowleadge of broad chinese market leads many companies to make erroneous market studies that provide insufficient information on the competitiveness of the choosen supplier. When choosing a wrong manufacturer, problems can start rapidly.\nCost reduction study: A problem that arises at the initial phase of the process but is often not detected until later. When you  start calculating the cost per imported products, ertain factors may not be taken into account such as payment of customs duties or even the cost of travel to China that may be necessary if the purchase process requires for it.\n",
      "author": "Dream",
      "id": 5
    },
    {
      "title": "FREQUENT COMPLICATION DURING THE MANUFACTURING PROCESS",
      "body": "It seems that the majority of people who look to making international purchases, are every clear that the manufacturing stage is the stage in which the greatest problems can arise. This is not necessarily true since many setbacks in the production of the product derive from bad pre-planning. Therefore there are some of the main setbacks that companies often encounter at this stage.\nCOMMUNICATION PROBLEM: In many cases, this is definitely the origin of the rest of the problems. It is not simply language, but also certain Asian Cultural factors as well as the usual forms of negotiation in China. The factor of \"not understanding\" goes far beyond words. POSSIBLE FAILURES OR ERRORS IN THE PRODUCT: Derived from poor communication or sometimes from erroneous explanation of the requirements, the products to be imported may sometimes present design errors that can ruin importation. Not being able to be there in time to solve potential problems in the first products, ends up causing some companies to receive entire containers that do not meet their expectations.\nQUALITY STANDARDS: This is not a fault per se, but it can be huge problem . The quality standards in China do not usually match with those of the destination country.This sometimes can cause a setback if it is not detected in time, even making the final sale of item impossible. \nThere are many cases of companies that successfully pass the first two stages but who subsequently experience a nightmare before receiving the products in their country. This is mainly due to two factors.\nLong waiting times: Although we live in a more connected world than ever, receiving a purchase from China is not synonymous with speed. From the moment the products leaves the factory until they arrive at the company, can take from two weeks to two months in the worst-case scenerio. This wait that, in addition to being long, can sometimes be worsened because it is impossible to monitor the exact state of the import operation. \nCUSTOMS: Customs controls can become real headache if they are not well manged. Further to the additional tariffs and fees to pay (which many companies have not taken into account during the initial study), sometimes the product does not meet the requirements for importation.\n",
      "author": "Dream",
      "id": 6
    },
    {
      "title": "PROPOSED SOLUTION ",
      "body": "Economics of most developing countries is dependent on import. Not only the industrial goods but also agricultural goods are imported to fulfill the demand of the country. The trade balance is very high in Developing countries. Import rate is higher than export. But import business has many problems. Some steps should be taken to solve these problems.                                                                              FORMULATING PROPER IMPORT POLICY: To solve import business, the proper import policy is essential. By formulating proper import policy government can stop importing of unnecessary goods. In Developing countries import policy is not so strong and realistic.\n DEVELOPING OF WAREHOUSE AND DISTRIBUTION CHANNELS: In Developing countries the warehousing system and distribution channel are very low facilitated. But warehousing and distribution channel plays great role to reach these products to the consumers. So government and non government organization should take proper steps to improve the condition of warehousing and distribution channel. Then the consumers can get the goods cheaply.\n INFORMATION REGARDING FOREIGN MARKET: In information system of developing countries is not very advanced so their importers are not able to collect information from their foreign market. If the importers could collect the information such as quantity and quality of products, price and others, they could import goods of the country which one is cheap, then it might be possible to reduce the cost.\n TRAINING IMPORTERS: Most of the importers in the developing countries are unaware of import business. They don't know the rules and regulation about import. To change these situation, importers should be given proper training and also be given idea about foreign market and products.\n",
      "author": "Dream",
      "id": 7
    }
  ]
}